<!DOCTYPE html>

<html>

<head>
	<title>Comprar Fichas</title>
	<link rel=StyleSheet type="text/css" href="css/estilo.css" />
	<meta charset="UTF-8">
</head>

<body>
	<h1>Comprar Fichas</h1>
	
	<p>
		Al acceder a este men&uacute;, el usuario encontrar&aacute; la siguiente pantalla:
		
		<br>
		<br>
		
		<img src="img/comprar_fichas.jpg" width="500" height="300">
		
		<br>
		<br>
		
		El panel de compra de fichas dispone de las siguientes &aacute;reas:
		
		<br>
		
		<ul>
			<li>El panel para la selecci&oacute;n de las fichas a adquirir, situado a la izquierda.
			<li>Un cuadro en el que se muestra el saldo y valor del usuario con respecto a las fichas deseadas.
			<li>Botones de Comprar y Cancelar, adem&aacute;s de un aviso en caso de que el usuario no haya vinculado un m&eacute;todo de pago.
		</ul>
		
		<h2>Panel de selecci&oacute;n</h2>
		
		En este panel se puede seleccionar las fichas deseadas para su compra:
		
		<br>
		<br>
		
		<img src="img/comprar_fichas_1.jpg">
		
		<br>
		<br>
		
		Dentro de este, se muestra el icono correspondiente a la ficha de cada tipo, adem&aacute;s de un selector num&eacute;rico,
		de forma que el usuario pueda accionar las flechas para incrementar o decrementar el n&uacute;mero de fichas deseadas de cada tipo.
		
		<br>
		<br>
		
		Tambi&eacute;n es posible acceder a cada selector mediante la combinaci&oacute;n de teclas: "Alt" + cualquier n&uacute;mero del 1 al 5 ambos incluidos.
		De esta manera, como ejemplo, la combinaci&oacute;n de teclas "Alt" + 1 corresponde al selector de fichas de 5€.
		
		<br>
		<br>
		
		Adem&aacute;s, a la derecha del selector se muestra un cuadro con el hipot&eacute;tico n&uacute;mero de fichas de ese tipo
		de las que dispondr&iacute;a el usuario tras realizar la compra de ese n&uacute;mero de fichas indicado en el selector.
		
		<br>
		
		<h2>Cuadro de c&aacute;lculos</h2>
		
		Tras seleccionar las fichas deseadas, este panel se rellenar&aacute; con una serie de valores num&eacute;ricos:
		
		<br>
		<br>
		
		<img src="img/comprar_fichas_2.jpg">
		
		<br>
		
		<ul>
			<li><b>Saldo</b>: Saldo disponible del usuario antes de realizar la compra.
			<li><b>A pagar</b>: Saldo a restar por la compra de las fichas seleccionadas.
			<li><b>Restante</b>: Resultante de la resta del saldo menos la cantidad a pagar.
		</ul>
		
		(El campo <b>Restante</b> mostrar&aacute; un aviso en color rojo cuando no haya saldo suficiente para realizar la compra)
		
		<ul>
			<li><b>Valor</b>: Valor total constituido por las fichas pose&iacute;das por el usuario antes de realizar la compra.
			<li><b>A añadir</b>: Valor que se añadir&aacute; al valor del usuario por la compra de las fichas seleccionadas.
			<li><b>Valor final</b>: Resultante de la suma del valor a añadir al valor antes de la compra.
		</ul>
		
		Los campos A pagar y A a&ntilde;adir aparecer&aacute;n vac&iacute;os si no se selecciona ninguna ficha a comprar.
		
		<br>
		<br>
		
		<h2>Botones</h2>
		
		El usuario dispone del bot&oacute;n <img src="img/btn_comprar.jpg"> y del bot&oacute;n <img src="img/btn_cancelar.jpg">
		en base a lo que quiera hacer con su compra de fichas.
		
		N&oacute;tese que <b>el bot&oacute;n Comprar permanecer&aacute; deshabilitado</b> mientras el usuario no interact&uacute;e con los selectores.
		
		Para confirmar la compra de fichas seleccionadas, bastar&aacute; con pulsar el bot&oacute;n <b>Comprar</b>.
		En caso contrario, si el cliente decide anular la compra, pulsar&aacute; el bot&oacute;n <b>Cancelar</b> y volver&aacute; a la pantalla de juego.
	</p>
	
</body>

</html>