<!DOCTYPE html>

<html>

<head>
	<title>Bebidas en Casino: Ruleta</title>
	<link rel=StyleSheet type="text/css" href="css/estilo.css" />
	<meta charset="UTF-8">
</head>

<body>
	<h1>Pedir Consumici&oacute;n</h1>
	
	<p>
		Al acceder a este men&uacute;, el usuario encontrar&aacute; la siguiente pantalla:
		
		<br>
		<br>
		
		<img src="img/pedir_bebidas.jpg" width="500" height="300">
		
		<br>
		<br>
		
		El panel para la solicitud de consumiciones desde el puesto de juego dispone de las siguientes &aacute;reas:
		
		<ul>
			<li>&Aacute;rea de texto inicialmente vac&iacute;a en la que se muestra el <b>pedido</b> y el precio de cada bebida a&ntilde;adida.
			<li>Campos que muestran el <b>precio total del pedido</b>, el <b>saldo</b> del cliente y el hipot&eacute;tico saldo <b>restante</b> tras la compra.
			<li>Panel de <b>botones</b> con los iconos de todas las <b>bebidas</b> disponibles en la carta para su incorporaci&oacute;n al pedido.
			<li>Opciones para confirmar el pedido o cancelar el mismo, adem&aacute;s de un posible aviso si el cliente no puede realizar el pedido.
		</ul>
		
		<h2>&iquest;C&oacute;mo a&ntilde;adir bebidas al pedido?</h2>
		En la mitad derecha de la pantalla, el usuario visualizar&aacute; una parrilla de botones con im&aacute;gen como la siguiente:
		
		<br>
		<br>
		
		<img src="img/menu_bebidas.jpg">
		
		<br>
		<br>
		
		Cada una de las im&aacute;genes corresponde a un bot&oacute;n. Pulsando cualquier bot&oacute;n de forma correcta,
		se a&ntilde;adir&aacute; al pedido <b>1 unidad</b> de la bebida correspondiente, lo cual podr&aacute; ser visualizado en el &aacute;rea de texto:
		
		<br>
		<br>
		
		<img src="img/pedido_bebidas.jpg">
		
		<br>
		<br>
		
		El comportamiento de los botones es el mismo en todos los casos.
		Adem&aacute;s, <b>se actualizar&aacute;n los campos</b> Precio Total y Saldo tras pedir.
		
		<br>
		
		<h2>&iquest;C&oacute;mo eliminar bebidas del pedido?</h2>
		
		Tal y como se mostr&oacute; en la imagen anterior, en el <b>&aacute;rea de texto del pedido</b>
	    es posible visualizar las bebidas actualmente a&ntilde;adidas al pedido, si las hay.
		
		De esta manera, bastar&aacute; con hacer click (o acceder mediante el teclado y desplazarse
		con las teclas de las flechas hasta alcanzar la bebida deseada) para seleccionar
		la bebida que el usuario desea borrar.
		A continuaci&oacute;n, bastar&aacute; con pulsar la tecla <b>"Supr"</b>, y la bebida seleccionada
		ser&aacute; eliminada del pedido.
		
		Adem&aacute;s, <b>se actualizar&aacute;n los campos</b> Precio Total y Saldo tras pedir.
		
		<br>
		
		<h2>&iquest;C&oacute;mo confirmar el pedido?</h2>
		
		En la zona inferior de la mitad izquierda de la pantalla, el usuario dispondr&aacute;
		de los botones <img src="img/btn_pedir.jpg"> y <img src="img/btn_cancelar.jpg">.
		
		Inicialmente, el bot&oacute;n <img src="img/btn_pedir.jpg"> se encontrar&aacute; inhabilitado,
		por lo que es necesario que el usuario a&ntilde;ada alguna bebida al pedido para poder confirmarlo.
		
		Si el cliente finalmente decide cancelar su pedido, puede hacerlo libremente
		mediante el bot&oacute;n <img src="img/btn_cancelar.jpg"> y el pedido ser&aacute; desechado para la pr&oacute;xima vez.
	</p>
	
</body>

</html>